{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "dermatolog\u00eda",
    "1": "traumatolog\u00eda",
    "2": "pediatr\u00eda",
    "3": "medicina interna",
    "4": "medicina general"
  },
  "initializer_range": 0.02,
  "label2id": {
    "dermatolog\u00eda": 0,
    "medicina general": 4,
    "medicina interna": 3,
    "pediatr\u00eda": 2,
    "traumatolog\u00eda": 1
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "output_past": true,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.53.1",
  "vocab_size": 119547
}
